Tekla Open API Reference for Tekla Structures 2025
StringList.LastIndexOf Method (String, Int32, Int32)
 Searches for the last occurence of the string in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LastIndexOf(
	string value,
	int startIndex,
	int count
)
Public Function LastIndexOf (
	value As String,
	startIndex As Integer,
	count As Integer
) As Integer
Parameters
value
Type: System.String
The string to locate.
startIndex
Type: System.Int32
The index to start the search from.
count
Type: System.Int32
The number of items searched.
Return Value
Type: Int32
The last index of the string if found, otherwise -1.
See Also
Reference
StringList Class
LastIndexOf Overload
Tekla.Structures.Drawing Namespace